### Forest calibnet Infrastructure Plan: success

<details><summary>Show Plan</summary>

```
module.calibnet.data.digitalocean_ssh_keys.keys: Reading...
module.calibnet.data.digitalocean_project.forest_project: Reading...
module.calibnet.data.digitalocean_ssh_keys.keys: Read complete after 0s [id=ssh_keys/10962629775372992364]
module.calibnet.digitalocean_droplet.forest: Refreshing state... [id=358387359]
module.calibnet.digitalocean_firewall.forest_firewall: Refreshing state... [id=fdaa8ced-5c83-49da-b685-1c2c94dcd600]
module.calibnet.data.digitalocean_project.forest_project: Read complete after 1s [id=da5e6601-7fd9-4d02-951e-390f7feb3411]
module.calibnet.digitalocean_project_resources.connect_forest_project: Refreshing state... [id=da5e6601-7fd9-4d02-951e-390f7feb3411]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.calibnet.digitalocean_droplet.forest must be replaced
-/+ resource "digitalocean_droplet" "forest" {
      ~ created_at           = "2023-06-01T11:25:10Z" -> (known after apply)
      ~ disk                 = 160 -> (known after apply)
      ~ id                   = "358387359" -> (known after apply)
      ~ ipv4_address         = "178.128.206.73" -> (known after apply)
      ~ ipv4_address_private = "10.135.0.4" -> (known after apply)
      + ipv6_address         = (known after apply)
      ~ locked               = false -> (known after apply)
      ~ memory               = 8192 -> (known after apply)
        name                 = "forest"
      ~ price_hourly         = 0.07143 -> (known after apply)
      ~ price_monthly        = 48 -> (known after apply)
      ~ private_networking   = true -> (known after apply)
      ~ status               = "active" -> (known after apply)
        tags                 = [
            "calibnet",
        ]
      ~ urn                  = "do:droplet:358387359" -> (known after apply)
      ~ user_data            = "6c39624ec53b10790026348a7c5c11aa3fb2c03e" -> "42178cac9395c9749e57baf220377ea880c73995" # forces replacement
      ~ vcpus                = 4 -> (known after apply)
      ~ volume_ids           = [] -> (known after apply)
      ~ vpc_uuid             = "46a525ac-fd37-47ea-bb10-95c1db0055f7" -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.calibnet.digitalocean_firewall.forest_firewall will be updated in-place
  ~ resource "digitalocean_firewall" "forest_firewall" {
      ~ droplet_ids     = [
          - 358387359,
        ] -> (known after apply)
        id              = "fdaa8ced-5c83-49da-b685-1c2c94dcd600"
        name            = "forest-calibnet-fw"
        tags            = [
            "calibnet",
        ]
        # (3 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.calibnet.digitalocean_project_resources.connect_forest_project will be updated in-place
  ~ resource "digitalocean_project_resources" "connect_forest_project" {
        id        = "da5e6601-7fd9-4d02-951e-390f7feb3411"
      ~ resources = [
          - "do:droplet:358387359",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>